report/sysbench/SSP_test/oltp_read_write.master_ssp_200.txt
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 200
Report intermediate results every 5 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 5s ] thds: 200 tps: 8016.02 qps: 128540.94 (r/w/o: 80392.25/32077.28/16071.41) lat (ms,99%): 65.65 err/s: 0.20 reconn/s: 0.00
[ 10s ] thds: 200 tps: 8787.55 qps: 140697.95 (r/w/o: 87955.87/35165.99/17576.09) lat (ms,99%): 40.37 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 200 tps: 9789.27 qps: 156574.72 (r/w/o: 97831.30/39166.08/19577.34) lat (ms,99%): 36.24 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 200 tps: 8027.25 qps: 128431.54 (r/w/o: 80271.66/32104.79/16055.09) lat (ms,99%): 77.19 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 200 tps: 9963.13 qps: 159376.62 (r/w/o: 99606.06/39844.11/19926.45) lat (ms,99%): 32.53 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 200 tps: 9567.02 qps: 153109.68 (r/w/o: 95700.38/38274.67/19134.64) lat (ms,99%): 34.33 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 200 tps: 9918.19 qps: 158683.59 (r/w/o: 99177.87/39671.55/19834.17) lat (ms,99%): 33.72 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 200 tps: 8721.87 qps: 139590.27 (r/w/o: 87247.47/34897.87/17444.93) lat (ms,99%): 35.59 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 200 tps: 9073.42 qps: 145216.33 (r/w/o: 90761.00/36308.08/18147.24) lat (ms,99%): 34.33 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 200 tps: 8820.61 qps: 140962.55 (r/w/o: 88070.09/35252.04/17640.42) lat (ms,99%): 47.47 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 200 tps: 9158.15 qps: 146599.88 (r/w/o: 91652.95/36630.02/18316.91) lat (ms,99%): 37.56 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 200 tps: 9929.89 qps: 158858.08 (r/w/o: 99276.72/39720.97/19860.38) lat (ms,99%): 33.12 err/s: 0.00 reconn/s: 0.00
[ 65s ] thds: 200 tps: 9823.30 qps: 157183.00 (r/w/o: 98237.80/39299.40/19645.80) lat (ms,99%): 33.12 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 200 tps: 9646.11 qps: 154427.38 (r/w/o: 96525.11/38608.84/19293.42) lat (ms,99%): 34.33 err/s: 0.20 reconn/s: 0.00
[ 75s ] thds: 200 tps: 8837.14 qps: 141312.81 (r/w/o: 88312.38/35327.15/17673.28) lat (ms,99%): 34.33 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 200 tps: 9681.98 qps: 155212.64 (r/w/o: 96993.78/38853.51/19365.35) lat (ms,99%): 33.12 err/s: 0.00 reconn/s: 0.00
[ 85s ] thds: 200 tps: 9461.04 qps: 151076.99 (r/w/o: 94450.37/37705.55/18921.07) lat (ms,99%): 41.10 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 200 tps: 10020.90 qps: 160436.38 (r/w/o: 100270.38/40123.39/20042.60) lat (ms,99%): 32.53 err/s: 0.00 reconn/s: 0.00
[ 95s ] thds: 200 tps: 9861.64 qps: 157745.98 (r/w/o: 98585.16/39437.54/19723.27) lat (ms,99%): 33.12 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 200 tps: 7732.72 qps: 123719.53 (r/w/o: 77335.40/30918.68/15465.44) lat (ms,99%): 34.95 err/s: 0.00 reconn/s: 0.00
[ 105s ] thds: 200 tps: 9281.87 qps: 148488.73 (r/w/o: 92801.50/37124.48/18562.74) lat (ms,99%): 34.33 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 200 tps: 8338.81 qps: 133498.34 (r/w/o: 83450.09/33370.23/16678.02) lat (ms,99%): 75.82 err/s: 0.00 reconn/s: 0.00
[ 115s ] thds: 200 tps: 9553.03 qps: 152757.15 (r/w/o: 95454.14/38196.94/19106.07) lat (ms,99%): 34.33 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 200 tps: 10028.34 qps: 160506.31 (r/w/o: 100321.65/40129.78/20054.89) lat (ms,99%): 33.12 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            11104140
        write:                           4441650
        other:                           2220830
        total:                           17766620
    transactions:                        1110412 (9250.38 per sec.)
    queries:                             17766620 (148006.28 per sec.)
    ignored errors:                      2      (0.02 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          120.0383s
    total number of events:              1110412

Latency (ms):
         min:                                    7.44
         avg:                                   21.61
         max:                                  972.98
         99th percentile:                       36.89
         sum:                             24001121.65

Threads fairness:
    events (avg/stddev):           5552.0600/24.19
    execution time (avg/stddev):   120.0056/0.01