report/sysbench/SSP_test/oltp_update_index.master_ssm_200.txt
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 200
Report intermediate results every 5 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 5s ] thds: 200 tps: 46404.01 qps: 46404.01 (r/w/o: 0.00/46404.01/0.00) lat (ms,99%): 15.00 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 200 tps: 46758.34 qps: 46758.34 (r/w/o: 0.00/46758.34/0.00) lat (ms,99%): 15.27 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 200 tps: 47168.71 qps: 47168.71 (r/w/o: 0.00/47168.71/0.00) lat (ms,99%): 15.27 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 200 tps: 46203.69 qps: 46203.69 (r/w/o: 0.00/46203.69/0.00) lat (ms,99%): 16.12 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 200 tps: 45112.74 qps: 45112.74 (r/w/o: 0.00/45112.74/0.00) lat (ms,99%): 17.63 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 200 tps: 45934.85 qps: 45934.85 (r/w/o: 0.00/45934.85/0.00) lat (ms,99%): 15.55 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 200 tps: 42608.82 qps: 42608.82 (r/w/o: 0.00/42608.82/0.00) lat (ms,99%): 20.00 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 200 tps: 41342.69 qps: 41342.69 (r/w/o: 0.00/41342.69/0.00) lat (ms,99%): 22.69 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 200 tps: 46201.74 qps: 46201.74 (r/w/o: 0.00/46201.74/0.00) lat (ms,99%): 16.41 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 200 tps: 46461.45 qps: 46461.45 (r/w/o: 0.00/46461.45/0.00) lat (ms,99%): 16.12 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 200 tps: 46154.25 qps: 46154.25 (r/w/o: 0.00/46154.25/0.00) lat (ms,99%): 15.83 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 200 tps: 46369.71 qps: 46369.71 (r/w/o: 0.00/46369.71/0.00) lat (ms,99%): 15.83 err/s: 0.00 reconn/s: 0.00
[ 65s ] thds: 200 tps: 46637.42 qps: 46637.42 (r/w/o: 0.00/46637.42/0.00) lat (ms,99%): 16.12 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 200 tps: 47057.90 qps: 47057.90 (r/w/o: 0.00/47057.90/0.00) lat (ms,99%): 15.83 err/s: 0.00 reconn/s: 0.00
[ 75s ] thds: 200 tps: 47102.35 qps: 47102.35 (r/w/o: 0.00/47102.35/0.00) lat (ms,99%): 15.27 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 200 tps: 47036.46 qps: 47036.46 (r/w/o: 0.00/47036.46/0.00) lat (ms,99%): 15.00 err/s: 0.00 reconn/s: 0.00
[ 85s ] thds: 200 tps: 46226.93 qps: 46226.93 (r/w/o: 0.00/46226.93/0.00) lat (ms,99%): 15.27 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 200 tps: 46705.65 qps: 46705.65 (r/w/o: 0.00/46705.65/0.00) lat (ms,99%): 15.00 err/s: 0.00 reconn/s: 0.00
[ 95s ] thds: 200 tps: 46454.78 qps: 46454.78 (r/w/o: 0.00/46454.78/0.00) lat (ms,99%): 15.27 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 200 tps: 47237.04 qps: 47237.04 (r/w/o: 0.00/47237.04/0.00) lat (ms,99%): 14.73 err/s: 0.00 reconn/s: 0.00
[ 105s ] thds: 200 tps: 47714.20 qps: 47714.20 (r/w/o: 0.00/47714.20/0.00) lat (ms,99%): 14.73 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 200 tps: 46713.35 qps: 46713.35 (r/w/o: 0.00/46713.35/0.00) lat (ms,99%): 15.83 err/s: 0.00 reconn/s: 0.00
[ 115s ] thds: 200 tps: 47983.00 qps: 47983.00 (r/w/o: 0.00/47983.00/0.00) lat (ms,99%): 14.46 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 200 tps: 46491.71 qps: 46491.71 (r/w/o: 0.00/46491.71/0.00) lat (ms,99%): 15.55 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           5550834
        other:                           0
        total:                           5550834
    transactions:                        5550834 (46243.78 per sec.)
    queries:                             5550834 (46243.78 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          120.0328s
    total number of events:              5550834

Latency (ms):
         min:                                    1.47
         avg:                                    4.32
         max:                                  227.59
         99th percentile:                       15.83
         sum:                             23998784.55

Threads fairness:
    events (avg/stddev):           27754.1700/77.63
    execution time (avg/stddev):   119.9939/0.01